package by.htp.les03.main;
//2. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»

public class Task2 {

	public static void main(String[] args) {
		int x = 1;
		int y = 2;
		if (x < y) {
			System.out.println("yes");
		}
		else 
			System.out.println("no");
	}
	}

